Repository: kelvin124124/ChatTranslated
Catalog: ChatTranslated/Localization/Resources.*.resx
Languages: de_de, it_it, zh_cn, zh_tw

source: AllLanguages
de_de: Alle Sprachen
it_it: TutteLeLingue
zh_cn: 所有语言
zh_tw: 所有語言

# APIKeyWarn
source: Warning: API key will be stored as plain text in plugin configuration, any malware or third party plugins may have access to the key.
de_de: Warnung: API-Schlüssel wird als Klartext in der Plugin-Konfiguration gespeichert, jede Malware oder Drittanbieter-Plugins können auf den Schlüssel zugreifen.
it_it: Attenzione: la chiave API verrà memorizzata in testo semplice nella configurazione del plugin, qualsiasi malware o plugin di terze parti potrebbe avere accesso alla chiave.
zh_cn: 警告：API 密钥将以纯文本形式存储在插件配置中， 任何恶意软件或第三方插件都可以访问该密钥。
zh_tw: 警告：API 密鑰將以純文字形式儲存在插件配置中， 任何惡意軟體或第三方插件都可能有權存取該密鑰。

source: Apply
de_de: Anwenden
it_it: Applica
zh_cn: 应用
zh_tw: 應用

# AskProceed
source: Proceed?
de_de: Fortfahren?
it_it: Procedere?
zh_cn: 要继续吗？
zh_tw: 要繼續嗎？

source: Channel Selection
de_de: Chat-Kanäle Auswahl
it_it: Selezione del Canale
zh_cn: 频道选项
zh_tw: 頻道選項

source: Chat Integration
it_it: Integrazione della Chat
zh_cn: 聊天内集成
zh_tw: 聊天集成

source: Chinese (Simplified)
de_de: Chinesisch (vereinfacht)
it_it: Cinese (Semplificato)
zh_cn: 简体中文
zh_tw: 簡體中文

source: Chinese (Traditional)
de_de: Chinesisch (traditionell)
it_it: Cinese (Tradizionale)
zh_cn: 繁体中文
zh_tw: 繁體中文

source: CrossLinkShell1
de_de: Welten-Kontaktkreis1
zh_cn: 跨服通讯贝1
zh_tw: 跨服通訊貝1

source: CrossLinkShell2
de_de: Welten-Kontaktkreis2
zh_cn: 跨服通讯贝2
zh_tw: 跨服通訊貝2

source: CrossLinkShell3
de_de: Welten-Kontaktkreis3
zh_cn: 跨服通讯贝3
zh_tw: 跨服通訊貝3

source: CrossLinkShell4
de_de: Welten-Kontaktkreis4
zh_cn: 跨服通讯贝4
zh_tw: 跨服通訊貝4

source: CrossLinkShell5
de_de: Welten-Kontaktkreis5
zh_cn: 跨服通讯贝5
zh_tw: 跨服通訊貝5

source: CrossLinkShell6
de_de: Welten-Kontaktkreis6
zh_cn: 跨服通讯贝6
zh_tw: 跨服通訊貝6

source: CrossLinkShell7
de_de: Welten-Kontaktkreis7
zh_cn: 跨服通讯贝7
zh_tw: 跨服通訊貝7

source: CrossLinkShell8
de_de: Welten-Kontaktkreis8
zh_cn: 跨服通讯贝8
zh_tw: 跨服通訊貝8

source: CrossParty
de_de: Gruppenübergreifend
zh_cn: 跨服小队
zh_tw: 跨服小隊

source: CustomLanguages
de_de: Benutzerdefinierte Sprachen
it_it: LinguePersonalizzate
zh_cn: 自定义语言
zh_tw: 自訂語言

# CustomTargetLanguageExplanation
source: You will be forced to use Google translate if you use custom languages.
de_de: Sie müssen Google Translate verwenden, wenn Sie benutzerdefinierte Sprachen verwenden.
it_it: Sarai costretto a utilizzare Google Translate se usi lingue personalizzate.
zh_cn: 如果您使用自定义语言，将强制使用Google翻译。
zh_tw: 如果您使用自訂語言，將强制使用Google翻譯。

# CustomTargetLanguageHeader
source: Custom target language
de_de: Benutzerdefinierte Zielsprache
it_it: Lingua personalizzata di destinazione
zh_cn: 自定义目标语言
zh_tw: 自定義目標語言

# DeepLAPIKey
source: DeepL API Key (Optional)
de_de: DeepL API-Schlüssel (Optional)
it_it: Chiave API DeepL (Opzionale)
zh_cn: DeepL API密钥（非必要）
zh_tw: DeepL API 密鑰（非必要）

# DeepLExplanation
source: DeepL will be used to translate chat messages. Google and Bing translate will be used as backup. If DeepL API key is provided below, it will be used as backup instead.
de_de: DeepL wird verwendet, um Chatnachrichten zu übersetzen. Google und Bing Translate werden als Backup verwendet. Wenn unten ein DeepL API-Schlüssel angegeben wird, wird dieser stattdessen als Backup verwendet.
it_it: DeepL sarà utilizzato per tradurre i messaggi di chat. Google e Bing Translate verranno utilizzati come backup. Se sotto viene fornita una chiave API DeepL, questa verrà utilizzata come backup.
zh_cn: DeepL 将用于翻译聊天讯息。 Google 和 Bing 翻译将被用作备用。 如果提供了下面的 DeepL API 密钥，将用作备用。
zh_tw: DeepL 將用於翻譯聊天訊息。 Google 和 Bing 翻譯將被用作備用。 如果提供了下面的 DeepL API 密鑰，將用作備用。

source: Default
de_de: Standard
it_it: Predefinito
zh_cn: 默认
zh_tw: 預設

# DefaultFilteringExplaination
source: Recommended. Translate non-Latin based languages. (Japanese, Korean, Chinese, etc.)
de_de: Empfohlen. Übersetzen Sie nicht-lateinische Sprachen. (Japanisch, Koreanisch, Chinesisch usw.)
it_it: Consigliato. Traduci lingue non basate sul latino. (Giapponese, Coreano, Cinese, ecc.)
zh_cn: 推荐。翻译非拉丁语系语言。 （日语、韩语、中文等）
zh_tw: 推薦選項，翻譯非拉丁語言 （日文、韓文、中文等）

# DomaStr
source: It's okay!
de_de: Kein Problem!
it_it: Va bene così!
zh_cn: 别在意。
zh_tw: 別在意。

source: Enable in duties
de_de: In Aufgaben aktivieren
it_it: Abilita in missioni
zh_cn: 在任务中启用
zh_tw: 在任務中啟用

source: Enable plugin
de_de: Plugin aktivieren
it_it: Abilita plugin
zh_cn: 启用插件
zh_tw: 啟用插件

source: English
de_de: Englisch
it_it: Inglese
zh_cn: 英语
zh_tw: 英語

source: FreeCompany
de_de: Freie Gesellschaft
it_it: CompagniaLibera
zh_cn: 部队
zh_tw: 部隊

source: French
de_de: Französisch
it_it: Francese
zh_cn: 法语
zh_tw: 法語

# GenericChannels
source: Generic
de_de: Allgemein
it_it: Generico
zh_cn: 通用
zh_tw: 通用

source: German
de_de: Deutsch
it_it: Tedesco
zh_cn: 德语
zh_tw: 德語

# GGstr
source: Good game!
de_de: Gutes Spiel!
it_it: Grande gioco!
zh_cn: 打得好！辛苦了！
zh_tw: 打得好！辛苦了！

source: Japanese
de_de: Japanisch
it_it: Giapponese
zh_cn: 日语
zh_tw: 日語

source: Korean
de_de: Koreanisch
it_it: Coreano
zh_cn: 韩语
zh_tw: 韓語

source: LLMProvider
it_it: Provider LLM
zh_cn: LLM提供者

# LLM_Proxy_Explanation
source: Self-hosted Gemini proxy
de_de: Self-hosted gemma-2-27b-it proxy
zh_cn: 自托管 Gemini 代理

source: Ls1
it_it: LinkShell1
zh_cn: 通讯贝1
zh_tw: 通訊貝1

source: Ls2
it_it: LinkShell2
zh_cn: 通讯贝2
zh_tw: 通訊貝2

source: Ls3
it_it: LinkShell3
zh_cn: 通讯贝3
zh_tw: 通訊貝3

source: Ls4
it_it: LinkShell4
zh_cn: 通讯贝4
zh_tw: 通訊貝4

source: Ls5
it_it: LinkShell5
zh_cn: 通讯贝5
zh_tw: 通訊貝5

source: Ls6
it_it: LinkShell6
zh_cn: 通讯贝6
zh_tw: 通訊貝6

source: Ls7
it_it: LinkShell7
zh_cn: 通讯贝7
zh_tw: 通訊貝7

source: Ls8
it_it: LinkShell8
zh_cn: 通讯贝8
zh_tw: 通訊貝8

source: No
de_de: Nein
zh_cn: 否
zh_tw: 否

source: NoviceNetwork
de_de: Neulingsnetzwerk
it_it: NetworkPerPrincipianti
zh_cn: 新人频道
zh_tw: 新人頻道

source: OpenAI API Key
it_it: Chiave API di OpenAI
zh_cn: OpenAI API 密钥
zh_tw: OpenAI API 密鑰

# OpenAIPriceEstimation
source: Price estimation: $2.0 /month
de_de: Price estimation: $0.4 /month
it_it: Price estimation: $0.4 /month
zh_cn: 预计价格：0.4 美元/月
zh_tw: 價格預計：USD 0.4/月

source: Party
de_de: Gruppe
it_it: Squadra
zh_cn: 小队
zh_tw: 小隊

source: Plugin UI Language
zh_cn: 插件语言

source: PvPTeam
de_de: PvpGruppe
it_it: SquadraPvP
zh_cn: 战队
zh_tw: 戰隊

source: Region
it_it: Regione
zh_cn: 地区
zh_tw: 地區

source: Say
de_de: Sagen
it_it: Parlara
zh_cn: 说话
zh_tw: 説話

source: See language list
de_de: Sprachliste ansehen
it_it: Vedi l'elenco delle lingue
zh_cn: 查看语言列表
zh_tw: 查看語言列表

source: Shout
de_de: Rufen
it_it: Grido
zh_cn: 喊话
zh_tw: 喊話

# SourceLang
source: What to translate
de_de: Was zu übersetzen
it_it: Cosa tradurre
zh_cn: 翻译对象
zh_tw: 翻譯對象

# SourceLangSelection
source: Source Language Selection
de_de: Quellsprachauswahl
it_it: Selezione della lingua di origine
zh_cn: 源语言选项
zh_tw: 翻譯對象語言選擇

source: Spanish
de_de: Spanisch
it_it: Spagnolo
zh_cn: 西班牙语
zh_tw: 西班牙語

# TargetLang
source: Translate to
de_de: Übersetzen nach
it_it: Tradurre in
zh_cn: 翻译至
zh_tw: 翻譯至

source: TellIncoming
it_it: Messaggio in arrivo
zh_cn: 悄悄话
zh_tw: 悄悄話

source: Translate
de_de: Übersetzen
it_it: Tradurre
zh_cn: 翻译
zh_tw: 翻譯

# TranslateAllExplaination
source: Translate all incoming messages. Didn't find your language in language selection? Send feedback from plugin installer!
de_de: Übersetze alle eingehenden Nachrichten. Keine Sprache in der Sprachauswahl gefunden? Feedback vom Plugin-Installer senden!
it_it: Tradurre tutti i messaggi in arrivo. Non hai trovato la tua lingua nella selezione delle lingue? Invia feedback dal programma di installazione del plugin!
zh_cn: 翻译所有收到的讯息。 没有在语言选项中找到您的语言？ 在插件安装界面中发送反馈！
zh_tw: 翻譯所有收到的訊息。 在語言選擇中沒有找到您的語言？ 在插件安裝界面發送反饋！

# TranslateButtonTooltip
source: Translate button only print translated text in the main window. It does not send translated text in chat or make it visible to other players.
de_de: Die Übersetzungsschaltfläche druckt nur den übersetzten Text im Hauptfenster. Sie sendet die übersetzte Nachricht nicht im Chat und macht sie für andere Spieler nicht sichtbar.
it_it: Il pulsante di traduzione stampa solo il testo tradotto nella finestra principale. Non invia il testo tradotto nella chat né lo rende visibile agli altri giocatori.
zh_cn: 翻译按钮仅在主窗口中打印翻译的文本。 它不会在聊天中发送翻译的文本或使其对其他玩家可见。
zh_tw: 翻譯按鈕僅在主視窗中列印翻譯後的文字。 它不會在聊天中發送翻譯文字或使其對其他玩家可見。

source: Translation Engine
de_de: Übersetzungsmaschine
it_it: Motore di traduzione
zh_cn: 翻译引擎
zh_tw: 翻譯引擎

# UseCustomTargetLanguage
source: Use Custom Language
de_de: Benutzerdefinierte Sprache verwenden
it_it: Usa lingua personalizzata
zh_cn: 使用自定义语言
zh_tw: 使用自定義語言

# WelcomeStr
source: Let's do it!
de_de: Lass es uns tun!
it_it: Facciamolo!
zh_cn: 请多指教！
zh_tw: 請多指教！

source: Yell
de_de: Rufen
it_it: Grida
zh_cn: 呼喊
zh_tw: 呼喊

source: Yes
de_de: Ja
it_it: Sì
zh_cn: 是
zh_tw: 是

# ChatIntegration_HideOriginal
source: Hide original message when outputting translated message
de_de: Originalnachricht ausblenden, wenn die übersetzte Nachricht ausgegeben wird
it_it: Nascondi il messaggio originale quando si outputta il messaggio tradotto
zh_cn: 输出翻译讯息时隐藏原始讯息
zh_tw: 輸出翻譯訊息時隱藏原始訊息

source: General
de_de: Allgemein
it_it: Generale
zh_cn: 通用
zh_tw: 通用

source: Languages
de_de: Sprachen
it_it: Lingue
zh_cn: 语言
zh_tw: 語言

source: Translation Mode
de_de: Übersetzungsmodus
it_it: Modalità di traduzione
zh_cn: 翻译模式
zh_tw: 翻譯模式

# ChatIntegration_ShowColoredText
source: Show colored text when outputting translated message
zh_cn: 输出翻译讯息时显示彩色文本
zh_tw: 輸出翻譯訊息時顯示彩色文本

# OpenAIAPIExplanation
source: May be restricted if you live in unsupported region.
de_de: GPT-4o-mini May be restricted if you live in unsupported region.
zh_cn: GPT-4o-mini 如果你居住在不支持的地区，可能会受到限制。
zh_tw: GPT-4o-mini 如果你居住在不支持的地區，可能會受到限制。

# OpenAICompatibleExplanation
source: Any custom providers with OpenAI-compatible API.
zh_cn: 任何具有OpenAI兼容API的自定义提供商。
zh_tw: 任何具有OpenAI兼容API的自定義提供商。

# OpenAICompatibleInfo
source: Models without system role is not supported.
zh_cn: 不支持没有系统角色的模型。
zh_tw: 不支持沒有系統角色的模型。

# LLMAPIKey
source: Api key
zh_cn: Api 密钥
zh_tw: Api 密鑰

# LLMModel
source: Model
zh_cn: 模型
zh_tw: 模型

# LLMApiEndpoint
source: Endpoint URL
zh_cn: 端点URL
zh_tw: 端點URL

# LLM_Explanation
source: Note: DeepL have better accuracy in single-language translation. LLM is better only if message is long or contain multiple languages.
it_it: Proxy gemma-2-27b-it autogestito Nota: DeepL ha una precisione migliore nella traduzione in una sola lingua. LLM è migliore solo se il messaggio è lungo o contiene più lingue.
zh_cn: 注意： DeepL 在单语言翻译中的准确性更高。 仅当消息较长或包含多种语言时，LLM 才会有更好表现。
zh_tw: 注意： DeepL 在單語言翻譯中的準確性更高。 僅當消息較長或包含多種語言時，LLM 才會有更好表現。

source: Use context
zh_cn: 使用上下文

# ChatContextExplanation
source: Include messages in current chat tab in LLM prompt.
zh_cn: 在LLM指令中加入当前聊天标签页中的消息。
